posts/2015-01-13-the-fourteenth-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer
#+title: The Fourteenth Sunday After Pentecost

I love it when a minister points out something that I had never noticed in the text. Mitch Randall certainly did that this past Sunday. So, this prayer recalls Daniel's action to save his competitors in Babylon as recounted in Daniel 2.

If there is to be a winner,\\
there must be a loser.\\
or so it goes in the games we play,\\
in games of sport,\\
and in games of life.

The clever person ensures success\\
by eliminating the competition.

Guns and knives are too crude\\
for our sophisticated times,\\
instead we use words\\
to harm reputations\\
and rumors to destroy characters.

And then, in the end,\\
we can rest content\\
in victory,\\
isolated and alone.

Lord,

Bid us again\\
to play in your fields,\\
where contact is\\
not hand-to-hand,\\
but hand-in-hand.

/Amen/
