docs/posts/2015-01-13-the-fourteenth-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 20, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Fourteenth Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Fourteenth Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
I love it when a minister points out something that I had never noticed in the text. Mitch Randall certainly did that this past Sunday. So, this prayer recalls Daniel&rsquo;s action to save his competitors in Babylon as recounted in Daniel 2.
</p>

<p>
If there is to be a winner,<br>
there must be a loser.<br>
or so it goes in the games we play,<br>
in games of sport,<br>
and in games of life.
</p>

<p>
The clever person ensures success<br>
by eliminating the competition.
</p>

<p>
Guns and knives are too crude<br>
for our sophisticated times,<br>
instead we use words<br>
to harm reputations<br>
and rumors to destroy characters.
</p>

<p>
And then, in the end,<br>
we can rest content<br>
in victory,<br>
isolated and alone.
</p>

<p>
Lord,
</p>

<p>
Bid us again<br>
to play in your fields,<br>
where contact is<br>
not hand-to-hand,<br>
but hand-in-hand.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 20, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
